
## Plan Result




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.opal-frontend-session-secret
  * random_string.session-secret
* Update
  * module.opal_redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.opal-frontend-session-secret will be created
  + resource "azurerm_key_vault_secret" "opal-frontend-session-secret" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-stg/providers/Microsoft.KeyVault/vaults/opal-stg"
      + name                    = "opal-frontend-session-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # random_string.session-secret will be created
  + resource "random_string" "session-secret" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

  # module.opal_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-cache-stg/providers/Microsoft.Cache/redis/opal-stg"
        name                          = "opal-stg"
        tags                          = {
            "application"         = "opal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/opal-frontend.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#opal-help"
            "environment"         = "staging"
            "managedBy"           = "Green on Black"
        }
        # (21 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 125 -> 642
          ~ maxmemory_delta                 = 125 -> 642
          ~ maxmemory_reserved              = 125 -> 642
            # (7 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"","Vars":{}} -->